package com.hfag.project42.triasEra;

import com.hfag.project42.R;

public class TriasEra {
    private String name;
    private String detail;
    private int imageResourcesId;
    private String firstDescription;
    private String description;


    public static final TriasEra[] triases = {
            new TriasEra("Целофизис",
                    "Поздний триас. период\n" +
                            "3 м в длину\n" +
                            "20 кг\n" +
                            "1881 г., США\n" +
                            "Пустое тело",
                    R.drawable.celofizis,
                    "Несколько разрозненных останков целофизиса впервые были найдены в " +
                            "1881 году. Затем в 1947 году очень много останков было обнаружено " +
                            "в Нью-Мексико; сохранность некоторых скелетов была поразительной: ни до, " +
                            "ни после этого не удавалось найти настолько хорошо сохранившиеся останки " +
                            "динозавров.",
                    "Для динозавров целофизисы были " +
                            "некрупными - всего лишь около 3 метров " +
                            "длиной, причем большая часть этой " +
                            "длины приходилась на шею и " +
                            "хвост. Хотя они и не были " +
                            "гигантами, но все же " +
                            "являлись опасными " +
                            "хищниками: при нападении " +
                            "на жертву они пускали в " +
                            "ход свои передние " +
                            "конечности.\n" + "\n" +
                            "КАННИБАЛЫ!\n" +
                            "Целофизисы одними из первых динозавров " +
                            "появились на Земле и одними из первых " +
                            "были досконально изучены. Наиболее " +
                            "потрясающим открытием было то, " +
                            "что целофизисы питались " +
                            "представителями своего собственного " +
                            "вида. Ученые были поражены, " +
                            "обнаружив кости детеныша " +
                            "целофизиса внутри грудной клетки " +
                            "взрослой особи."


                    ),
            new TriasEra("Мусзавр",
                    "Поздний триас. период\n" +
                            "3 м в длину\n" +
                            "150 кг\n" +
                            "1960 г., Аргентина\n" +
                            "Ящер-мышь",
                    R.drawable.muszavr,
                    "Мусзавры жили на Земле в триасский период и, следовательно, являлись одним из " +
                            "самых ранних видов динозавров. Впервые они были идентифицированы по " +
                            "скелету детеныша, найденному в Южной Америке, - одному из самых маленьких " +
                            "детенышей динозавра изо всех, когда-либо встречавшихся палеонтологам.",
                    "Мусзавры относились к типичным " +
                            "прозавроподам: у них была маленькая " +
                            "голова, длинная шея, массивное туловище "  +
                            "и длинный хвост; задние конечности более " +
                            "крупные, чем передние; на каждой " +
                            "ступне - по пять пальцев. " +
                            "Как и у всех прозавроподов, у " +
                            "мусзавров во рту было множество мелких " +
                            "зубов листовидной формы, которыми они " +
                            "<<обрабатывали>> свою растительную пищу. " +
                            "Зубы, наверно, использовались только для " +
                            "разрывания растения на достаточно " +
                            "мелкие кусочки, чтобы их можно было " +
                            "проглотить. Пищу зубами прозавроподы не " +
                            "пережевывали, они перетирали ее уже в " +
                            "желудке благодаря проrлоченным ими " +
                            "мелким камешкам, иначе их называют " +
                            "гастролитами. Хищники в улучшении " +
                            "своего пищеварения подобным образом не " +
                            "нуждались."),
            new TriasEra("Прокомсогнат",
                    "Поздний триас. период\n" +
                            "0.9 м в длину\n" +
                            "1 кг\n" +
                            "1909 г., Германия\n" +
                            "Бывшый до комсогната",
                    R.drawable.prokomsognat,
                    "Это один из самых мелких видов динозавров среди найденных на сегодняшний" +
                    "день. Майкл Кричтон сделал прокомпсогната одним из главных «Героев»" +
                    "«Затерянного мира», продолжения «Парка юрского периода», где динозавры" +
                    "«Возродились к жизни»." ,
                    "Весной 1909 года, производя раскопки в " +
                            "карьере по добыче щебня неподалеку от " +
                            "городка Хейлброн в Германии, " +
                            "палеонтологи наткнулись на весьма " +
                            "интересные ископаемые останки. " +
                            "Обнаружили они не целый скелет, а " +
                            "куски расколотого черепа, правую голень, " +
                            "бедренную кость и другие части скелета, " +
                            "неопровержимо доказывавшие, что " +
                            "найденный динозавр принадлежал к " +
                            "новому, ранеенеизвестному виду. Более " +
                            "того, останки датиравались концом " +
                            "триасского периода, когда динозавры " +
                            "только-только появились. Позднее " +
                            "новооткрытому виду было дано " +
                            "наименование <<прокомпсогнат>>; это один " +
                            "из нескольких уникальных видов " +
                            "динозавров, найденных в этой части " +
                            "Европы.\n" + "Скелеты мелких динозавров, весивших " +
                            "сравнительно мало, довольно легко и " +
                            "быстро разламывались на части после " +
                            "смерти ящера, в то время как костяки" +
                            " " +
                            "крупных динозавров в основном " +
                            "оставались неповрежденными. Вероятно, " +
                            "именно поэтому было обнаружено так " +
                            "мало останков мелких динозавров по " +
                            "сравнению с большим количеством " +
                            "найденных скелетов более крупных видов " +
                            "доисторических ящеров. " +
                            "Возможно, что и срок жизни мелких " +
                            "динозавров был короче, чем у их крупных " +
                            "сородичей. Многие маленькие " +
                            "динозавры могли стать жертвой " +
                            "огромных плотоядных ящеров, " +
                            "являясь легкой добычей из-за " +
                            "своихнебольших размеров."

            )
    };

    public TriasEra(String name, String detail, int imageResourcesId,String firstDescription, String description) {
        this.name = name;
        this.detail = detail;
        this.imageResourcesId = imageResourcesId;
        this.firstDescription = firstDescription;
        this.description = description;
    }

    public String getName() {
        return name;
    }

    public String getDetail() { return detail; }

    public int getImageResourcesId() {
        return imageResourcesId;
    }

    public String getFirstDescription() {
        return firstDescription;
    }

    public String getDescription() {
        return description;
    }
}
